Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.Unload(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementType)
Unloads the provided Coordination Model type element.
document:
The document.
coordinationModelType:
The Coordination Model type element to unload.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The element coordinationModelType was not found in the given document.
-or-
The provided element is not a Coordination Model type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
Failed to unload Coordination Model.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.ReloadAutodeskDocsCoordinationModelFrom(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementType,System.String,System.String,System.String,System.String)
Reloads a Autodesk Docs Coordination Model type from the specified Autodesk Docs data.
Remarks:
Authentication in Revit is a prerequisite for reloading Coordination Models from Autodesk Docs.
The Autodesk Docs data projectId, fileId and viewName can be retrieved from the web URL of the 3D view.
The Autodesk Docs account id can be retrieved from the Autodesk Docs Account settings.
This data can also be retrieved via the Data Management API or Autodesk Construction Cloud API.
document:
The document.
coordinationModelType:
The Coordination Model type element to reload.
accountId:
The id of the Autodesk Docs account.
projectId:
The id of the Autodesk Docs project.
fileId:
The id of the Autodesk Docs file.
A valid file id should start with "urn:WIPENVIRONMENT:dm.lineage:", followed by an unique identifier.
The WIPENVIRONEMNT varies from Region to Region.
For example, for an account created in US Region, WIPENVIRONMENT = adsk.wipprod and a valid file id would be urn:adsk.wipprod:dm.lineage:AoV26TGqRjuNs4ANq84ncQ.
viewName:
View name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Failed to validate file id.
-or-
document is not a project document.
-or-
The provided element is not a Autodesk Docs Coordination Model type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to validate web services environment.
-or-
Failed to validate authentication.
-or-
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
Failed to reload Coordination Model type from specified Autodesk Docs data.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.Reload(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementType)
Reloads the provided Coordination Model type element.
Remarks:
For a Coordination Model from Autodesk Docs, reload will get the latest version for the provided Coordination Model type element.
Authentication in Revit is a prerequisite for reloading Coordination Models from Autodesk Docs.
document:
The document.
coordinationModelType:
The Coordination Model type element to reload.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The element coordinationModelType was not found in the given document.
-or-
The provided element is not a Coordination Model type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to validate web services environment.
-or-
Failed to validate user authentication.
-or-
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
Failed to reload Coordination Model.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.Link3DViewFromAutodeskDocs(Autodesk.Revit.DB.Document,System.String,System.String,System.String,System.String,Autodesk.Revit.DB.ExternalData.CoordinationModelLinkOptions)
Creates a Coordination Model instance based on the information provided by the specified Autodesk Docs data and linking options.
Remarks:
Authentication in Revit is a prerequisite for linking Coordination Models from Autodesk Docs.
The Autodesk Docs data projectId, fileId and viewName can be retrieved from the web URL of the 3D view.
The Autodesk Docs account id can be retrieved from the Autodesk Docs Account settings.
This data can also be retrieved via the Data Management API or Autodesk Construction Cloud API.
document:
The document.
accountId:
The id of the Autodesk Docs account.
projectId:
The id of the Autodesk Docs project.
fileId:
The id of the Autodesk Docs file.
A valid file id should start with "urn:WIPENVIRONMENT:dm.lineage:", followed by an unique identifier.
The WIPENVIRONEMNT varies from Region to Region.
For example, for an account created in US Region, WIPENVIRONMENT = adsk.wipprod and a valid file id would be urn:adsk.wipprod:dm.lineage:AoV26TGqRjuNs4ANq84ncQ.
viewName:
View name.
linkOptions:
Options for linking.
Returns:
Returns the newly added Coordination Model instance of the 3D view from Autodesk Docs.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Failed to validate file id.
-or-
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to validate web services environment.
-or-
Failed to validate authentication.
-or-
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
Failed to create Coordination Model instance using specified data or an internal error occured.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2026.3